Autodesk.Revit.DB.ElementBinding.Categories
Retrieve or set the categories to which a parameter definition will be bound.
Remarks: The Categories property is used to set the categories to which the definition will
be bound when it is added to the document bindings. This property can also be read from existing
bindings to interrogate to which categories a parameter has been bound.

Autodesk.Revit.DB.ElementBinding
A base class for all types of binding that attach to an element.
Remarks: This base class provides methods that are common to all types of binding that
work with elements.